In [1]:
import pandas as pd
import numpy as np

In [2]:
student_data = {
    '이름' : ['민준','서연','도윤','예은','시우'],
    '나이' : [18,17,18,17,18],
    '도시' : ['서울','부산','서울','인천','부산'],
    '국어' : [85,92,78,95,88],
    '수학' : [90,88,93,76,82]
}
# student_data['이름']
df = pd.DataFrame(student_data)
df

   이름  나이  도시  국어  수학
0  민준  18  서울  85  90
1  서연  17  부산  92  88
2  도윤  18  서울  78  93
3  예은  17  인천  95  76
4  시우  18  부산  88  82

In [11]:
df.columns

Index(['이름', '나이', '도시', '국어', '수학'], dtype='object')

In [4]:
df.values

array([['민준', 18, '서울', 85, 90],
       ['서연', 17, '부산', 92, 88],
       ['도윤', 18, '서울', 78, 93],
       ['예은', 17, '인천', 95, 76],
       ['시우', 18, '부산', 88, 82]], dtype=object)

In [5]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [6]:
# 주요 속성
# shape : 
# df.shape : (5(행), 5(열))
# df.index : 행 인덱스 반환
# df.columns : 열 인덱스(컬럼명) 반환
# df.values : 모든 데이터를 ndarray 반환
# df.dtypes : 각 열(컬럼) 기준 데이터 타입 반환
# df.size : 데이터 개수 (5X5=25)
# df.ndim : 차원 반환 : 2
# df.T : Transpose(전치) => 행과 열을 교환
df1 = pd.DataFrame([
    [1,2],
    [3,4]
])
print(df1)
print(df1.T)

   0  1
0  1  2
1  3  4
   0  1
0  1  3
1  2  4

In [7]:
# 주요 메소드
# 1. 데이터 탐색 및 요약
# 1.1 head(n)
# 1.2 tail(n)
# 1.3 info()
# df.info() : 구조 확인
# describe() : 수치 데이터에 대한 통계량 확인
# value_counts() : 특정 컬럼에 대한 고유값 개수 반환
df['나이'].value_counts()

나이
18    3
17    2
Name: count, dtype: int64

In [12]:
# 데이터프레임에서 인덱싱, 슬라이싱, 팬시인덱싱, 블린인덱싱
student_data = {
    '이름' : ['민준','서연','도윤','예은','시우'],
    '나이' : [18,17,18,17,18],
    '도시' : ['서울','부산','서울','인천','부산'],
    '국어' : [85,92,78,95,88]
}
# student_data['이름']
df = pd.DataFrame(student_data, index=['A','B','C','D','E'])
df

   이름  나이  도시  국어
A  민준  18  서울  85
B  서연  17  부산  92
C  도윤  18  서울  78
D  예은  17  인천  95
E  시우  18  부산  88

In [13]:
# 1. 기본 인덱싱 : 특정 열이나 행 하나를 선택하는 방법, [] 연산자 사용
# 1.1 컬럼 인덱싱 
print(df['이름'])

A    민준
B    서연
C    도윤
D    예은
E    시우
Name: 이름, dtype: object

In [10]:
# 여러개 컬럼 선택
# 1. 슬라이싱 : 연속된 여러개 => loc, iloc을 사용해야 한다.
# df['이름':'도시'] 이건 안된다

# 2. 팬시인덱싱 : 비연속된 여러개 
df[['국어','이름']]

   국어  이름
A  85  민준
B  92  서연
C  78  도윤
D  95  예은
E  88  시우

In [ ]:
df.loc['B':'D']
df.loc[['B','C','D']] # 팬시인덱싱, 팬시인덱싱은 대괄호
df.loc['B':'D',['이름','나이','도시']]
df.loc['B':'D','이름':'도시']  # 슬라이싱 해서 머신러닝,딥러닝 집어넣어야함, 콜론(:) = 연속된 범위
df.loc[:,:] # 전체슬라이싱(:연속 범위 지정),행(start:end), 열(start:end) 선택
#리스트랑 다른점: 마지막 end-1을 하지 않는다.레이블 인덱싱 처리를 해서 그럼

#복습: 리스트에서 콜론 들어가는 4가지
#start:end, X:end,start:X, X:X

df.loc['C':,:'도시'] # 도윤부터 다 가져와라~
#파이썬 2장이 중요함~~

df.loc[['B','D'],['이름','국어']] # 팬시색인, 
#주로: 컬럼은 비연속, 로우는 연속처리
df.loc[:,['이름','국어']] #전체 가져올꺼면 대괄호 없애야함 ,이런경우가 많음

   이름  국어
A  민준  85
B  서연  92
C  도윤  78
D  예은  95
E  시우  88

In [26]:
print(df['나이'] ==18)
print(df)
print(df[df['나이']==18])
#팬시색인이지만 ,LOC 적용가능하다.

A     True
B    False
C     True
D    False
E     True
Name: 나이, dtype: bool
   이름  나이  도시  국어
A  민준  18  서울  85
B  서연  17  부산  92
C  도윤  18  서울  78
D  예은  17  인천  95
E  시우  18  부산  88
   이름  나이  도시  국어
A  민준  18  서울  85
C  도윤  18  서울  78
E  시우  18  부산  88

In [45]:
#블리언 인덱싱
#도시: 서울, 국어 > 90
df
df[(df['도시'] == '서울')  & (df['국어']>=90)]

Empty DataFrame
Columns: [이름, 나이, 도시, 국어]
Index: []

In [64]:
# 정리
# 1.LOC[행,열] : 레이블 기반으로 행과 열 선택
# 1.iloc[행,열] : 정수인덱스 기반으로 행,열 선택
# 3.query (문자열 조건식)
query = '도시=="서울" and 국어 >= 80' #컬럼은 변수명 , 문자열 처리 X , 바깥에 작은따옴표, 안에는 큰따음표 !형식 지키기
df.query(query)

# 4. isin(리스트) # 너무중요!! 리스트로 쌓아야 함!!!!, 한개일지라도 list 로 감싸기!!!!!!!!!! =>return boolean Series
# 서울,인천 학생 조회
# df['도시'].isin[('서울','인천')]
df['도시'].isin(['서울','인천']) # 불리언으로 먼저 뽑고 그걸 아래 df에다가 놓는다.
df[df['도시'].isin(['서울','인천'])]

#5.filter : 특정 컬럼 선택
df.filter(like='시') # regex:정규표현식을 줄 수 있다, 컬럼명 검색
df.filter(like='이') # regex:정규표현식을 줄 수 있다, 컬럼명 검색

   이름  나이
A  민준  18
B  서연  17
C  도윤  18
D  예은  17
E  시우  18

In [ ]:
#3. DataFrame object method  : 데이터 정렬 및 변경
#3.1 정렬: sort_values(by = '컬럼명', ascending = True) : 특정 컬럼 기준 정렬시 사용 , 내림차순: False

df

# 이름	나이	도시	국어
# A	민준	18	서울	85
# B	서연	17	부산	92
# C	도윤	18	서울	78
# D	예은	17	인천	95
# E	시우	18	부산	88

df.sort_values(by='나이', ascending = False)
df['국어'].sort_values() #진짜 많이 함!~~차트그릴때 무진장 많이 씀
#팬시색인을 하면 한개라도 DataFrame 이다!
print(df[['국어']].sort_values(by='국어')) # '국어'열을 포함한 DataFrame 정렬

print(df['국어'].sort_values()) #'국어'열을 정렬,1차원

   국어
C  78
A  85
E  88
B  92
D  95
C    78
A    85
E    88
B    92
D    95
Name: 국어, dtype: int64

In [83]:
print(df[['국어']].sort_values(by='국어')) # '국어'열을 포함한 DataFrame 정렬

   국어
C  78
A  85
E  88
B  92
D  95

In [84]:
print(df['국어'].sort_values()) #'국어'열을 정렬,1차원

C    78
A    85
E    88
B    92
D    95
Name: 국어, dtype: int64

In [104]:
df.sort_index(axis=0) # 행방향,오름차순 sort 해라
df.sort_index(ascending=False) # axis=0(행기준),ascending =True(오름차순)default
df.sort_index(axis=1) # axis=1(열기준)정렬, ascending=True(오름차순) default

#3.3 drop(레이블,axis =0 ) :특정 행들 또는 열들 삭제할때 사용,여러개=>리스트다!
df.drop('도시',axis= 1) #불필요한 컬럼 지울때 사용, 엄청 많이 씀
df # <중요> 원본은 지워지지 않음 =>inplace 사용해야함

df.drop(['나이','도시'], axis =1 ) # 컬럼방향으로 지울려면 axis = 1 해야함
# 디폴트, inplace=False : 원본에 반영되지 않는다.

#df.rename(columns = 딕셔너리): 컬럼명 변경
df.rename(columns={'국어':'Kor'})
df # 중요한건!! 원본은 바뀌지 않는다.

# astype(데이터타입)
df.dtypes
df['나이'].astype('Int16') #어차피 데이터차지 많이 안해서 그릇 크기를 줄여줘야함
#나중에 overflow발생할수 있는 원인,
df.dtypes

이름    object
나이     int64
도시    object
국어     int64
dtype: object

In [105]:
#많이나오는 부분~~.. 설명위주로 수업
#4.데이터 집계와 그룹화
df

   이름  나이  도시  국어
A  민준  18  서울  85
B  서연  17  부산  92
C  도윤  18  서울  78
D  예은  17  인천  95
E  시우  18  부산  88

In [ ]:
# 4.1 groupby(by=컬럼들) : return GroupbyDataFrame , DataFrame 이다
# 특정 컬럼을 기준으로 데이터를 그룹화 한다.<주의> group by는 그룹화 까지만 한다.
sgb = df.groupby(by='도시')['국어'].mean()
# 즉, 그룹으로 묶여 있는 것들에서 mean 때린다!!.
print(sgb)
print(sgb.mean())
print(sgb.sum())

#4.2 agg(function) / aggregate(function)
#도시별 나이와 국어의 평균
df.groupby (by="도시").agg({'나이':'mean','국어':'sum'}) # 콜론별 별도함수 지정가능

도시
부산    90.0
서울    81.5
인천    95.0
Name: 국어, dtype: float64
88.83333333333333
266.5

      나이   국어
도시
부산  17.5  180
서울  18.0  163
인천  17.0   95

In [129]:

#4.3 pivot_table(): 데이터 재구성
df
#도시별 나이의 평균국어 점수
df.pivot_table(index ='도시'
              ,columns ='나이'
              ,values = '국어'
              ,fill_value=0
              ,aggfunc = 'sum') #aggfunc=mean default

#pivot table에는 group by랑 aggregation 이 합쳐진거임!

나이  17   18
도시
부산  92   88
서울   0  163
인천  95    0

In [ ]:
#5.결측치 처리(Missing Value) 처리
#4.1 isnull/isna
df.isnull().sum() #sum때리면, 컬럼별 결측치 개수
#결측치 시각화 라이브러리
#missingno lib : nan을 삭제할까말까 고민할때 시각화로 보여줌
#notnull/notna()
df.notnull().sum()
#5.3 fillna(value) : 결측치를 특정값으로 채울때 사용(평균,최빈값)
#5.4 drapna() : 결측치가 포함된 행 또는 열 삭제, 상당히 조심해야함!!
# , axis 지정필요(axis = 0(행),1(열)) / dataframe에서는 거의 사용안하는게 좋음....
#왜냐, 데이터는 돈이다!!

이름    5
나이    5
도시    5
국어    5
dtype: int64

In [ ]:
#메소드 체이닝(Method Chaining)
#도시는 서울,나이는 18인 학생들의 평균
city ="부산"
age = 18
# df.groupby (by="도시").agg({'도시':'서울','나이':'18'})

df.pivot_table(index ='도시'
              ,columns ='나이'
              ,values = '국어'
              ,fill_value=0
              ,aggfunc = 'mean')

sgb = df.groupby(by='도시')['국어'].mean()
print(sgb)

(#소괄호 쓰면 한줄한줄 테스트할때 편하다
 #q = f'도시=={city} and 나이 =={age}' ==>error 많이 난다.
df.query('도시==@city and 나이==@age')  # 전체 바꿀필요없이 하나씩 확인 가능함, ~~참 편함~~~~
#['국어']
#.mean()
)

도시
부산    90.0
서울    81.5
인천    95.0
Name: 국어, dtype: float64

   이름  나이  도시  국어
E  시우  18  부산  88

In [1]:

#20251014-인덱스가 키처럼 활용됨
#인덱스-행,열인덱스 따로 있다.
#인덱스 종류: 레이블,숫자기반

In [3]:
student_data = {
    '이름' : ['민준','서연','도윤','예은','시우'],
    '나이' : [18,17,18,17,18],
    '도시' : ['서울','부산','서울','인천','부산'],
}
# student_data['이름']
df = pd.DataFrame(student_data)
df

#set_index():'이름'이라는 컬럼을 행(row)로 보낼 수 있다.
# 즉,이름이 pk가 된다
# 장점:한번에 여러개 컬럼 보낼 수 있다.

   이름  나이  도시
0  민준  18  서울
1  서연  17  부산
2  도윤  18  서울
3  예은  17  인천
4  시우  18  부산

In [ ]:
# df1=df.set_index([]) 여러컬럼을 인덱스(PK)로 보낼  수 있다.
#인덱스는 PK처럼 활용: 식별 & 선택 , 중복,NaN도 들어갈 수 있음, 중복선택가능함
# df1= df.set_index('이름',inplace=False) # 즉 원본은 안바뀐다.
#헷갈림 주의 : inplace= False 일때 원본이 안바뀌는 거임!(TRUE X)
# inplace=True 해서 원본수정하면 다시 데이터 수집부터 다시 해야함
# df1 = df.set_index('이름',inplace=True) # return : None 나옴!!!
#True 언제사용? 남아있는 메모리 용량이 작을때 왜냐하면, false를 데이터를 복사해서 메모리차지 엄청 함

KeyError: "None of ['이름'] are in the columns"

In [10]:
df1=df.set_index('이름')
df2 = df1.reset_index()
df2.reset_index()

   index  이름  나이  도시
0      0  민준  18  서울
1      1  서연  17  부산
2      2  도윤  18  서울
3      3  예은  17  인천
4      4  시우  18  부산

In [11]:
#시리즈연산:요소별 연산가능(for문 없이도 반복연산 가능)
#한쪽에만 인덱스가 존재할땐 NaN나옴

In [15]:
# 산술연산
# 1. 시리즈간의 산술연산
midterm = pd.Series({'민준':85,'서연':92,'도윤':78,})
#midtern
final = pd.Series({'민준':90,'서연':88,'예은':95})

total = midterm+final
total

도윤      NaN
민준    175.0
서연    180.0
예은      NaN
dtype: float64

In [10]:
#2.데이터프레임 간의 연산
#브로드캐스팅 : 엄청중요함 
score_df = pd.DataFrame({
    '이름': ['민준','서연','도윤'],
    '국어' : [85,92,78,],
    '수학' : [90,88,93]    
})
score_df
#for문: 병렬처리 X ,#elementwise: 병렬처리 가능 -> GPU 쓰는이유

   이름  국어  수학
0  민준  85  90
1  서연  92  88
2  도윤  78  93

In [14]:
score_df1 = score_df.set_index('이름')
# score_df1
bonus_df = score_df1 + 5
bonus_df 
#결론: 리스트가지고 작업X ndarry -> tensorflow

    국어  수학
이름
민준  90  95
서연  97  93
도윤  83  98

In [16]:

print(bonus_df['국어'])
print(bonus_df['국어']+5)
#시리즈로 결과가 나온다
#인덱스로 붙는다, 어차피 인덱스로 연산됨
#series 나 dataframe 에서는 어차피 index가 남는다.

이름
민준    90
서연    97
도윤    83
Name: 국어, dtype: int64
이름
민준     95
서연    102
도윤     88
Name: 국어, dtype: int64

In [17]:
#5. 필터링

#5.1 불린인덱싱(Boolena Indexing)
#대괄호 연산자 안에 불리언 들어가면: row 선택

In [20]:
#query 메소드 활용
#isin()메소드 활용: 안에 있니?
#텍스트처리
score_df['이름'] # object이기 때문에 아직 정확히 문자열은 X
score_df['이름'].str # str있으면  method 나옴 , series 에서 str의미
#StringMethods : 문자열의미

In [23]:
#str
emails = pd.Series([ # 대괄호 하고 Enter하는게 좋음
    'test.user@google.com',
    'student.kim@naver.com',
    'admin@korea.ac.kr'
])
emails #인덱스 안줬기때문에 0,1,2로 들어감

0     test.user@google.com
1    student.kim@naver.com
2        admin@korea.ac.kr
dtype: object

In [30]:
#contains(찾을 문자열) =>return boolean
# emails.str.contains('google')
# 0     True
# 1    False
# 2    False
# dtype: bool

emails[emails.str.contains('google')]

0    test.user@google.com
dtype: object

In [38]:
# split
split_emails = emails.str.split('@',expand=True) # expand:칼럼으로 나눈다.
split_emails.columns = ['id','domain']
split_emails #댓글들 한번에 다룰 수 있음

            id       domain
0    test.user   google.com
1  student.kim    naver.com
2        admin  korea.ac.kr

In [ ]:
#part2.데이터 입출력
#파일 --입력--> 기준APP --출력-->
#입출력 함수 제공됨
#xls, xlsx 에따라 파일 포맷달라짐